//
//  MentorDataStore.swift
//  itMentors
//
//  Created by Иван Дрожжин on 27.07.2022.
//

class MentorDataStore {
    let names = [
        "Василий", "Александр", "Евгений",
        "Афанасий", "Петр", "Алексей",
        "Георгий", "Иван", "Степан",
        "Борис", "Николай", "Константин",
        "Виталий", "Михаил", "Владислав",
        "Владимир", "Владлен", "Лев",
        "Егор", "Кузьма", "Тимофей",
        "Дмитрий", "Максим", "Карен",
        "Кирилл", "Илья", "Денис",
        "Павел", "Никита", "Игорь"
    ]
    let surnames = [
        "Петров", "Иванов", "Смирнов",
        "Осипов", "Коновалов", "Толстой",
        "Васечкин", "Калинин", "Малинин",
        "Меладзе", "Цискаридзе", "Лапочкин",
        "Айтишев", "Свифтов", "Котлин",
        "Паскалев", "Сишарпов", "Шарапов",
        "Питонов", "Гадюкин", "Ужев",
        "Никитин", "Цветков", "Горшков",
        "Ахметов", "Кайметов", "Цой",
        "Овечкин", "Березутский", "Буре"
    ]
    let cities = [
        "Москва", "Санкт-Петербург", "Сочи",
        "Казань", "Воронеж", "Краснодар",
        "Екатеринбург", "Ростов-на-Дону", "Новосибирск",
        "Нижний Новгород", "Новокузнецк", "Кемерово",
        "Владивосток", "Владикавказ", "Тверь",
        "Калуга", "Нальчик", "Сомленск",
        "Самара", "Севастополь", "Тамбов",
        "Тюмень", "Томск", "Омск",
        "Красноярск", "Калининград", "Петропавловск Камчатский",
        "Грозный", "Махачкала", "Мурманск",
        "Минск", "Астана", "Одинцово",
        "Можайск", "Йошкар-Ола", "Пенза"
    ]
    let scopes = [
        "Swift", "Objective-C", "Python",
        "JavaScript", "C#", "C++",
        "Kotlin", "PHP", "Delphi",
        "Golang", "Java"
    ]
}
